#!/bin/bash

# Перевірка наявності параметра
if [ -z "$1" ]; then
  echo "Будь ласка, вкажіть формат файлів, наприклад: *.txt або *.pdf"
  exit 1
fi

# Змінна для збереження формату файлів
file_format=$1

# Визначення шляху до нової директорії у поточній директорії
new_dir="./newdir"

# Створення нової директорії, якщо вона не існує
mkdir -p "$new_dir"

# Копіювання файлів у нову директорію
cp $file_format "$new_dir"

# Повідомлення про успішне завершення копіювання
echo "Копіювання завершено. Файли скопійовані до: $new_dir"
